///////////////////////////////////////////////////////////////////
//
// Модуль-перечисления, типы блоков подставновки шаблонов
//
// (с) BIA Technologies, LLC	
//
///////////////////////////////////////////////////////////////////

Перем Неизвестный Экспорт;
Перем УстановкаКурсора Экспорт;
Перем ВыборВарианта Экспорт;
Перем ДатаВремя Экспорт;

///////////////////////////////////////////////////////////////////
// Программный интерфейс
///////////////////////////////////////////////////////////////////

// Возвращает список всех доступных типов, тип "Неизвестный" не включен
//
//  Возвращаемое значение:
//   Массив - Коллекция строк-идентификаторов доступных типов
//
Функция ВсеТипы() Экспорт

	ТипыШаблонов =  Новый Массив();
	
	ТипыШаблонов.Добавить(УстановкаКурсора);
	ТипыШаблонов.Добавить(ВыборВарианта);
	ТипыШаблонов.Добавить(ДатаВремя);
	
	Возврат ТипыШаблонов;

КонецФункции

///////////////////////////////////////////////////////////////////

Неизвестный = "Неизвестный";
УстановкаКурсора = "Установка курсора";
ВыборВарианта = "Выбор варианта";
ДатаВремя = "Дата время";

