///////////////////////////////////////////////////////////////////
//
// Базовые методы для работы с шаблонами
//
// (с) BIA Technologies, LLC	
//
///////////////////////////////////////////////////////////////////


///////////////////////////////////////////////////////////////////
// Программный интерфейс
///////////////////////////////////////////////////////////////////

// Инициализирует структуру корневого элемента шаблона
//
//  Возвращаемое значение:
//   Структура - Описание корневого элемента
//
Функция КорневойЭлемент() Экспорт

	Возврат Новый Структура("Тип, Наименование, Элементы", "Корень", "Корень", Новый Массив());

КонецФункции

// Инициализирует структуру группы шаблона
//
//  Возвращаемое значение:
//   Структура - Описание группы шаблона
//
Функция Группа() Экспорт
	
	Возврат Новый Структура("Тип, Наименование, Элементы", "Группа", "", Новый Массив());

КонецФункции

// Инициализирует структуру элемента шаблона
//
//  Возвращаемое значение:
//   Структура - Описание элемента шаблона
//
Функция Элемент() Экспорт
	
	Возврат Новый Структура("Тип, Наименование, ТекстЗамены, Шаблон", "Элемент");

КонецФункции

///////////////////////////////////////////////////////////////////
// Служебный функционал
///////////////////////////////////////////////////////////////////